vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
            if (dmx_data_buffer.slots_in_packet > dmx::kChannelsMax) {
                dmx_data_buffer.slots_in_packet |= dmx::kDmxSlotsCompleteFlag;

                rx_buffer.state = dmx::TxRxState::kIdle;
                break;
            }
#else
            auto index = rx_buffer.dmx.current.slots_in_packet;
            rx_buffer.dmx.current.data[index] = kData;
            index++;
            rx_buffer.dmx.current.slots_in_packet = index;

            if (index > dmx::kChannelsMax) {
                index |= 0x8000;
                rx_buffer.dmx.current.slots_in_packet = index;
                rx_buffer.state = dmx::TxRxState::kIdle;
                break;
            }
#endif
        } break;
        case dmx::TxRxState::kRdmData: {
            auto index = rx_buffer.rdm.index;
            rx_buffer.rdm.data[index] = kData;
            index++;
            rx_buffer.rdm.index = index;

            const auto* p = reinterpret_cast<volatile struct TRdmMessage*>(&rx_buffer.rdm.data[0]);

            if ((index >= 24) && (index <= sizeof(struct TRdmMessage)) && (index == p->message_length)) {
                rx_buffer.state = dmx::TxRxState::kRdmChecksumh;
            } else if (index > sizeof(struct TRdmMessage)) {
                rx_buffer.state = dmx::TxRxState::kIdle;
            }
        } break;
        case dmx::TxRxState::kRdmChecksumh: {
            auto index = rx_buffer.rdm.index;
            rx_buffer.rdm.data[index] = kData;
            index++;
            rx_buffer.rdm.index = index;
            rx_buffer.state = dmx::TxRxState::kRdmChecksuml;
        } break;
        case dmx::TxRxState::kRdmChecksuml: {
            auto index = rx_buffer.rdm.index;
            rx_buffer.rdm.data[index] = kData;
            index |= 0x4000;
            rx_buffer.rdm.index = index;
            rx_buffer.state = dmx::TxRxState::kIdle;
            gsv_rdm_data_receive_end[port_index]= DWT->CYCCNT;
        } break;
        case dmx::TxRxState::kRdmdisc: {
            auto index = rx_buffer.rdm.index;

            if (index < 24) {
                rx_buffer.rdm.data[index] = kData;
                index++;
                rx_buffer.rdm.index = index;
            }
        } break;
        default:
#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
            dmx_data_buffer.slots_in_packet = 0;
#else
            rx_buffer.dmx.current.slots_in_packet = 0;
#endif
            rx_buffer.rdm.index = 0;
            rx_buffer.state = dmx::TxRxState::kIdle;
            break;
    }
}

template <uint32_t UsartPeripheral, uint32_t DmaController, dma_channel_enum DmaChannel> 
void DmaStartTx(const uint8_t* data, uint32_t length) {
    auto dma_chctl = DMA_CHCTL(DmaController, DmaChannel);
    // Disable channel
    dma_chctl &= ~DMA_CHXCTL_CHEN;
    DMA_CHCTL(DmaController, DmaChannel) = dma_chctl;
    // Clear transfer complete interrupt
    Gd32DmaInterruptFlagClear<DmaController, DmaChannel, DMA_INTF_FTFIF>();
    // Configure transfer
    DMA_CHMADDR(DmaController, DmaChannel) = reinterpret_cast<uint32_t>(data);
    DMA_CHCNT(DmaController, DmaChannel) = length & DMA_CHXCNT_CNT;
    // Re-enable channel and interrupt
    dma_chctl |= DMA_CHXCTL_CHEN | DMA_INTERRUPT_ENABLE;
    DMA_CHCTL(DmaController, DmaChannel) = dma_chctl;
    // Enable USART DMA transmission
    USART_CTL2(UsartPeripheral) |= USART_TRANSMIT_DMA_ENABLE;
}

template <uint32_t UsartPeripheral, uint32_t DmaController, dma_channel_enum DmaChannel, typename TxBufferType> 
void DmaRestartDmxTx(TxBufferType& tx_buffer) {
    auto& dmx = tx_buffer.dmx;

    if (dmx.read_index != dmx.write_index) {
        dmx.read_index ^= 1;
    }

    const auto& packet = dmx.data[dmx.read_index];

    DmaStartTx<UsartPeripheral, DmaController, DmaChannel>(packet.data, packet.length);
}

#define DMA_RESTART_DMX_TX(PORT_INDEX, USARTx, DMAx, CHx) \
    DmaRestartDmxTx<USARTx, DMAx, CHx>(s_DmxTxBuffer[PORT_INDEX])

template <uint32_t UsartPeripheral, uint32_t DmaController, dma_channel_enum DmaChannel, typename TxBufferType> 
void DmaStartRdmTx(TxBufferType& tx_buffer) {
    const auto& packet = tx_buffer.rdm.data;

    DmaStartTx<UsartPeripheral, DmaController, DmaChannel>(packet.data, packet.length);
}

#define DMA_START_RDM_TX(PORT_INDEX, USARTx, DMAx, CHx) \
    DmaStartRdmTx<USARTx, DMAx, CHx>(s_RdmTxBuffer[PORT_INDEX])

extern "C" {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
#if defined(DMX_USE_USART0)
void USART0_IRQHandler() {
    IrqHandlerDmxRdmInput<USART0, dmx::config::kUsart0Port>();
}
#endif // defined(DMX_USE_USART0)

#if defined(DMX_USE_USART1)
void USART1_IRQHandler() {
    IrqHandlerDmxRdmInput<USART1, dmx::config::kUsart1Port>();
}
#endif // defined(DMX_USE_USART1)

#if defined(DMX_USE_USART2)
void USART2_IRQHandler() {
    IrqHandlerDmxRdmInput<USART2, dmx::config::kUsart2Port>();
}
#endif // defined(DMX_USE_USART2)

#if defined(DMX_USE_UART3)
void UART3_IRQHandler() {
    IrqHandlerDmxRdmInput<UART3, dmx::config::kUart3Port>();
}
#endif // defined(DMX_USE_UART3)

#if defined(DMX_USE_UART4)
void UART4_IRQHandler() {
    IrqHandlerDmxRdmInput<UART4, dmx::config::kUart4Port>();
}
#endif // defined(DMX_USE_UART4)

#if defined(DMX_USE_USART5)
void USART5_IRQHandler() {
    IrqHandlerDmxRdmInput<USART5, dmx::config::kUsart5Port>();
}
#endif // defined(DMX_USE_USART5)

#if defined(DMX_USE_UART6)
void UART6_IRQHandler() {
    IrqHandlerDmxRdmInput<UART6, dmx::config::kUart6Port>();
}
#endif // defined(DMX_USE_UART6)

#if defined(DMX_USE_UART7)
void UART7_IRQHandler() {
    IrqHandlerDmxRdmInput<UART7, dmx::config::kUart7Port>();
}
#endif // defined(DMX_USE_UART7)
#endif // !defined(CONFIG_DMX_TRANSMIT_ONLY)

void TIMER1_IRQHandler() {
// USART 0
#if defined(DMX_USE_USART0)
    if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) {
        if (s_DmxTxBuffer[dmx::config::kUsart0Port].state != dmx::TxRxState::kIdle) [[likely]] {
            switch (s_DmxTxBuffer[dmx::config::kUsart0Port].state) {
                case dmx::TxRxState::kDmxInter:
                    [[likely]] {
                        Gd32GpioModeOutput<USART0_GPIOx, USART0_TX_GPIO_PINx>();
                        GPIO_BC(USART0_GPIOx) = USART0_TX_GPIO_PINx;
                        s_DmxTxBuffer[dmx::config::kUsart0Port].state = dmx::TxRxState::kDmxBreak;
                        TIMER_CH0CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.break_time;
                    }
                    break;

                case dmx::TxRxState::kDmxBreak:
                    [[likely]] {
                        Gd32GpioModeAf<USART0_GPIOx, USART0_TX_GPIO_PINx, USART0>();
                        s_DmxTxBuffer[dmx::config::kUsart0Port].state = dmx::TxRxState::kDmxMab;
                        TIMER_CH0CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.mab_time;
                    }
                    break;

                case dmx::TxRxState::kDmxMab:
                    [[likely]] {
                        DMA_RESTART_DMX_TX(dmx::config::kUsart0Port, USART0, USART0_DMAx, USART0_TX_DMA_CHx);
                    }
                    break;

                default:
                    [[unlikely]] break;
            }
        } else if (s_RdmTxBuffer[dmx::config::kUsart0Port].state != dmx::RdmTxState::kIdle) {
            switch (s_RdmTxBuffer[dmx::config::kUsart0Port].state) {
                case dmx::RdmTxState::kBreak:
                    [[likely]] {
                        Gd32GpioModeAf<USART0_GPIOx, USART0_TX_GPIO_PINx, USART0>();
                        s_RdmTxBuffer[dmx::config::kUsart0Port].state = dmx::RdmTxState::kMab;
                        TIMER_CH0CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kMabTimeTypical;
                    }
                    break;

