vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
                case dmx::RdmTxState::kMab:
                    [[likely]] {
                        DMA_START_RDM_TX(dmx::config::kUsart0Port, USART0, USART0_DMAx, USART0_TX_DMA_CHx);
                    }
                    break;

                case dmx::RdmTxState::kDirection: {
                    s_RdmTxBuffer[dmx::config::kUsart0Port].state = dmx::RdmTxState::kIdle;
                    sv_port_state[dmx::config::kUsart0Port] = dmx::PortState::kIdle;
                    Dmx::Get()->SetPortDirection<dmx::config::kUsart0Port, dmx::Direction::kInput, true>();

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
                    const auto kSent = sv_total_statistics[dmx::config::kUsart0Port].rdm.sent.classes + 1;
                    sv_total_statistics[dmx::config::kUsart0Port].rdm.sent.classes = kSent;
#endif //! defined(CONFIG_DMX_DISABLE_STATISTICS)
                } break;

                default:
                    [[unlikely]] assert(false);
                    break;
            }
        }

        TIMER_INTF(TIMER1) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH0);
    }
#endif // defined(DMX_USE_USART0)
// USART 1
#if defined(DMX_USE_USART1)
    if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH1) == TIMER_INT_FLAG_CH1) {
        if (s_DmxTxBuffer[dmx::config::kUsart1Port].state != dmx::TxRxState::kIdle) [[likely]] {
            switch (s_DmxTxBuffer[dmx::config::kUsart1Port].state) {
                case dmx::TxRxState::kDmxInter:
                    [[likely]] {
                        Gd32GpioModeOutput<USART1_GPIOx, USART1_TX_GPIO_PINx>();
                        GPIO_BC(USART1_GPIOx) = USART1_TX_GPIO_PINx;
                        s_DmxTxBuffer[dmx::config::kUsart1Port].state = dmx::TxRxState::kDmxBreak;
                        TIMER_CH1CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.break_time;
                    }
                    break;

                case dmx::TxRxState::kDmxBreak:
                    [[likely]] {
                        Gd32GpioModeAf<USART1_GPIOx, USART1_TX_GPIO_PINx, USART1>();
                        s_DmxTxBuffer[dmx::config::kUsart1Port].state = dmx::TxRxState::kDmxMab;
                        TIMER_CH1CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.mab_time;
                    }
                    break;

                case dmx::TxRxState::kDmxMab:
                    [[likely]] {
                        DMA_RESTART_DMX_TX(dmx::config::kUsart1Port, USART1, USART1_DMAx, USART1_TX_DMA_CHx);
                    }

                    break;
                default:
                    [[unlikely]] break;
            }
        } else if (s_RdmTxBuffer[dmx::config::kUsart1Port].state != dmx::RdmTxState::kIdle) {
            switch (s_RdmTxBuffer[dmx::config::kUsart1Port].state) {
                case dmx::RdmTxState::kBreak:
                    [[likely]] {
                        Gd32GpioModeAf<USART1_GPIOx, USART1_TX_GPIO_PINx, USART1>();
                        s_RdmTxBuffer[dmx::config::kUsart1Port].state = dmx::RdmTxState::kMab;
                        TIMER_CH1CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kMabTimeTypical;
                    }
                    break;

                case dmx::RdmTxState::kMab:
                    [[likely]] {
                        DMA_START_RDM_TX(dmx::config::kUsart1Port, USART1, USART1_DMAx, USART1_TX_DMA_CHx);
                    }
                    break;

                case dmx::RdmTxState::kDirection: {
                    s_RdmTxBuffer[dmx::config::kUsart1Port].state = dmx::RdmTxState::kIdle;
                    sv_port_state[dmx::config::kUsart1Port] = dmx::PortState::kIdle;
                    Dmx::Get()->SetPortDirection<dmx::config::kUsart1Port, dmx::Direction::kInput, true>();

#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
                    const auto kSent = sv_total_statistics[dmx::config::kUsart1Port].rdm.sent.classes + 1;
                    sv_total_statistics[dmx::config::kUsart1Port].rdm.sent.classes = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
                } break;

                default:
                    [[unlikely]] assert(false);
                    break;
            }
        } else [[unlikely]] {
            assert(false);
        }

        TIMER_INTF(TIMER1) = static_cast<uint32_t>(~TIMER_INT_FLAG_CH1);
    }
#endif // defined(DMX_USE_USART1)
// USART 2
#if defined(DMX_USE_USART2)
    if ((TIMER_INTF(TIMER1) & TIMER_INT_FLAG_CH2) == TIMER_INT_FLAG_CH2) {
        if (s_DmxTxBuffer[dmx::config::kUsart2Port].state != dmx::TxRxState::kIdle) [[likely]] {
            switch (s_DmxTxBuffer[dmx::config::kUsart2Port].state) {
                case dmx::TxRxState::kDmxInter:
                    [[likely]] {
                        Gd32GpioModeOutput<USART2_GPIOx, USART2_TX_GPIO_PINx>();
                        GPIO_BC(USART2_GPIOx) = USART2_TX_GPIO_PINx;
                        s_DmxTxBuffer[dmx::config::kUsart2Port].state = dmx::TxRxState::kDmxBreak;
                        TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.break_time;
                    }
                    break;

                case dmx::TxRxState::kDmxBreak:
                    [[likely]] {
                        Gd32GpioModeAf<USART2_GPIOx, USART2_TX_GPIO_PINx, USART2>();
                        s_DmxTxBuffer[dmx::config::kUsart2Port].state = dmx::TxRxState::kDmxMab;
                        TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.mab_time;
                    }
                    break;

                case dmx::TxRxState::kDmxMab:
                    [[likely]] {
                        DMA_RESTART_DMX_TX(dmx::config::kUsart2Port, USART2, USART2_DMAx, USART2_TX_DMA_CHx);
                    }
                    break;

                default:
                    [[unlikely]] assert(false);
                    break;
            }
        } else if (s_RdmTxBuffer[dmx::config::kUsart2Port].state != dmx::RdmTxState::kIdle) {
            switch (s_RdmTxBuffer[dmx::config::kUsart2Port].state) {
                case dmx::RdmTxState::kBreak:
                    [[likely]] {
                        Gd32GpioModeAf<USART2_GPIOx, USART2_TX_GPIO_PINx, USART2>();
                        s_RdmTxBuffer[dmx::config::kUsart2Port].state = dmx::RdmTxState::kMab;
                        TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kMabTimeTypical;
                    }
                    break;

