vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
    Gd32DmaInterruptFlagClear<DMA0, DMA_CH6, DMA_INTERRUPT_FLAG_CLEAR>();
}
#endif // defined(DMX_USE_USART1)
// USART 2
#if defined(DMX_USE_USART2)
#if defined(GD32F4XX) || defined(GD32H7XX)
void DMA0_Channel3_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA0, DMA_CH3, DMA_INTERRUPT_DISABLE>();

        if (s_DmxTxBuffer[dmx::config::kUsart2Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUsart2Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUsart2Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUsart2Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[dmx::config::kUsart2Port].dmx.sent + 1;
            sv_total_statistics[dmx::config::kUsart2Port].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUsart2Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUsart2Port].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA0, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR>();
}
#else
void DMA0_Channel1_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA0, DMA_CH1, DMA_INTERRUPT_DISABLE>();

        if (s_DmxTxBuffer[dmx::config::kUsart2Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUsart2Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUsart2Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUsart2Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[dmx::config::kUsart2Port].dmx.sent + 1;
            sv_total_statistics[dmx::config::kUsart2Port].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUsart2Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUsart2Port].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_CLEAR>();
}
#endif
#endif // #if defined(DMX_USE_USART2)
// UART 3
#if defined(DMX_USE_UART3)
#if defined(GD32F4XX) || defined(GD32H7XX)
void DMA0_Channel4_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH4, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA0, DMA_CH4, DMA_INTERRUPT_DISABLE>();

        if (s_DmxTxBuffer[dmx::config::kUart3Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUart3Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUart3Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUart3Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[dmx::config::kUart3Port].dmx.sent + 1;
            sv_total_statistics[dmx::config::kUart3Port].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUart3Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUart3Port].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA0, DMA_CH4, DMA_INTERRUPT_FLAG_CLEAR>();
}
#else
void DMA1_Channel4_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA1, DMA_CH4, DMA_INTERRUPT_DISABLE>();

        if (s_DmxTxBuffer[dmx::config::kUart3Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUart3Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUart3Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUart3Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[dmx::config::kUart3Port].dmx.sent + 1;
            sv_total_statistics[dmx::config::kUart3Port].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUart3Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUart3Port].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_CLEAR>();
}
#endif
#endif
// UART 4
#if defined(DMX_USE_UART4)
#if defined(GD32F20X)
void DMA1_Channel3_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA1, DMA_CH3, DMA_INTERRUPT_DISABLE>();

        if (s_DmxTxBuffer[dmx::config::kUart4Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUart4Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUart4Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUart4Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[dmx::config::kUart4Port].dmx.sent + 1;
            sv_total_statistics[dmx::config::kUart4Port].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUart4Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUart4Port].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR>();
}
#endif //  defined(GD32F20X)
#if defined(GD32F4XX) || defined(GD32H7XX)
void DMA0_Channel7_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH7, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA0, DMA_CH7, DMA_INTERRUPT_DISABLE>();

        if (s_DmxTxBuffer[dmx::config::kUart4Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUart4Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUart4Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUart4Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[dmx::config::kUart4Port].dmx.sent + 1;
            sv_total_statistics[dmx::config::kUart4Port].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUart4Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUart4Port].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA0, DMA_CH7, DMA_INTERRUPT_FLAG_CLEAR>();
}
#endif // defined(GD32F4XX) || defined(GD32H7XX)
#if defined(GD32F10X) || defined(GD32F30X)
#error Not available
#endif // defined (GD32F10X) || defined (GD32F30X)
#endif // defined(DMX_USE_UART4)
// USART 5
#if defined(DMX_USE_USART5)
void DMA1_Channel6_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH6, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA1, DMA_CH6, DMA_INTERRUPT_DISABLE>();

