vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
        if (s_DmxTxBuffer[dmx::config::kUsart5Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUsart5Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUsart5Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUsart5Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[dmx::config::kUsart5Port].dmx.sent + 1;
            sv_total_statistics[dmx::config::kUsart5Port].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUsart5Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUsart5Port].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA1, DMA_CH6, DMA_INTERRUPT_FLAG_CLEAR>();
}
#endif // defined(DMX_USE_USART5)
// UART 6
#if defined(DMX_USE_UART6)
#if defined(GD32F20X)
void DMA1_Channel4_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA1, DMA_CH4, DMA_INTERRUPT_DISABLE>();

        if (s_DmxTxBuffer[dmx::config::kUart6Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUart6Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUart6Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUart6Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[dmx::config::kUart6Port].dmx.sent + 1;
            sv_total_statistics[dmx::config::kUart6Port].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUart6Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUart6Port].state = dmx::RdmTxState::kDirection;
        }
    }
}

Gd32DmaInterruptFlagClear<DMA1, DMA_CH4, DMA_INTERRUPT_FLAG_CLEAR>();
}
#endif
#if defined(GD32F4XX) || defined(GD32H7XX)
void DMA0_Channel1_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA0, DMA_CH1, DMA_INTERRUPT_DISABLE>();

        if (s_DmxTxBuffer[dmx::config::kUart6Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUart6Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUart6Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUart6Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[dmx::config::kUart6Port].dmx.sent + 1;
            sv_total_statistics[dmx::config::kUart6Port].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUart6Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUart6Port].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_CLEAR>();
}
#endif
#endif
// UART 7
#if defined(DMX_USE_UART7)
#if defined(GD32F20X)
void DMA1_Channel3_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA1, DMA_CH3, DMA_INTERRUPT_DISABLE>();

        if (s_DmxTxBuffer[dmx::config::kUart7Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUart7Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUart7Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUart7Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            sv_total_statistics[dmx::config::kUart7Port].dmx.sent++;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUart7Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUart7Port].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR>();
}
#endif
#if defined(GD32F4XX) || defined(GD32H7XX)
void DMA0_Channel0_IRQHandler() {
    if (Gd32DmaInterruptFlagGet<DMA0, DMA_CH0, DMA_INTERRUPT_FLAG_GET>()) {
        Gd32DmaInterruptDisable<DMA0, DMA_CH0, DMA_INTERRUPT_DISABLE>();

        if (s_DmxTxBuffer[dmx::config::kUart7Port].state != dmx::TxRxState::kIdle) [[likely]] {
            if (s_DmxTxBuffer[dmx::config::kUart7Port].output_style == dmx::OutputStyle::kDelta) {
                s_DmxTxBuffer[dmx::config::kUart7Port].state = dmx::TxRxState::kIdle;
            } else {
                TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + s_dmx_transmit.inter_time;
                s_DmxTxBuffer[dmx::config::kUart7Port].state = dmx::TxRxState::kDmxInter;
            }
#if !defined(CONFIG_DMX_DISABLE_STATISTICS)
            const auto kSent = sv_total_statistics[dmx::config::kUart7Port].dmx.sent + 1;
            sv_total_statistics[dmx::config::kUart7Port].dmx.sent = kSent;
#endif // !defined(CONFIG_DMX_DISABLE_STATISTICS)
        } else if (s_RdmTxBuffer[dmx::config::kUart7Port].state != dmx::RdmTxState::kIdle) {
            TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kDirectionTime;
            s_RdmTxBuffer[dmx::config::kUart7Port].state = dmx::RdmTxState::kDirection;
        }
    }

    Gd32DmaInterruptFlagClear<DMA0, DMA_CH0, DMA_INTERRUPT_FLAG_CLEAR>();
}
#endif // defined(GD32F4XX) || defined(GD32H7XX)
#if defined(GD32F10X) || defined(GD32F30X)
#error Not available
#endif // defined (GD32F10X) || defined (GD32F30X)
#endif // defined(DMX_USE_UART7)
}

[[gnu::noinline]]
void Dmx::SetPortDirection(uint32_t port_index, dmx::Direction port_direction, bool enable_data) {
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    if (port_direction_[port_index] != port_direction) {
        port_direction_[port_index] = port_direction;

        DataDisable(port_index);

        if (port_direction == dmx::Direction::kOutput) {
            GPIO_BOP(kDirGpio[port_index].port) = kDirGpio[port_index].pin;
        } else if (port_direction == dmx::Direction::kInput) {
            GPIO_BC(kDirGpio[port_index].port) = kDirGpio[port_index].pin;
        } else [[unlikely]]{
            assert(false);
        }
    } else if (!enable_data) {
        DataDisable(port_index);
    }

