vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
#if defined(DMX_USE_USART1)
        case USART1: {
            Gd32GpioModeOutput<USART1_GPIOx, USART1_TX_GPIO_PINx>();
            GPIO_BC(USART1_GPIOx) = USART1_TX_GPIO_PINx;
            TIMER_CH1CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kBreakTimeTypical;
            s_RdmTxBuffer[dmx::config::kUsart1Port].state = dmx::RdmTxState::kBreak;
            return;
        } break;
#endif // defined(DMX_USE_USART1)

#if defined(DMX_USE_USART2)
        case USART2: {
            Gd32GpioModeOutput<USART2_GPIOx, USART2_TX_GPIO_PINx>();
            GPIO_BC(USART2_GPIOx) = USART2_TX_GPIO_PINx;
            TIMER_CH2CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kBreakTimeTypical;
            s_RdmTxBuffer[dmx::config::kUsart2Port].state = dmx::RdmTxState::kBreak;
            return;
        } break;
#endif // defined(DMX_USE_USART2)

#if defined(DMX_USE_UART3)
        case UART3: {
            Gd32GpioModeOutput<UART3_GPIOx, UART3_TX_GPIO_PINx>();
            GPIO_BC(UART3_GPIOx) = UART3_TX_GPIO_PINx;
            TIMER_CH3CV(TIMER1) = TIMER_CNT(TIMER1) + rdm::transmit::kBreakTimeTypical;
            s_RdmTxBuffer[dmx::config::kUart3Port].state = dmx::RdmTxState::kBreak;
            return;
        } break;
#endif // defined(DMX_USE_UART3)
       // TIMER 4
#if defined(DMX_USE_UART4)
        case UART4: {
            Gd32GpioModeOutput<UART4_TX_GPIOx, UART4_TX_GPIO_PINx>();
            GPIO_BC(UART4_TX_GPIOx) = UART4_TX_GPIO_PINx;
            TIMER_CH0CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kBreakTimeTypical;
            s_RdmTxBuffer[dmx::config::kUart4Port].state = dmx::RdmTxState::kBreak;
            return;
        } break;
#endif //  defined(DMX_USE_UART4)

#if defined(DMX_USE_USART5)
        case USART5: {
            Gd32GpioModeOutput<USART5_GPIOx, USART5_TX_GPIO_PINx>();
            GPIO_BC(USART5_GPIOx) = USART5_TX_GPIO_PINx;
            TIMER_CH1CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kBreakTimeTypical;
            s_RdmTxBuffer[dmx::config::kUsart5Port].state = dmx::RdmTxState::kBreak;
            return;
        } break;
#endif // defined(DMX_USE_USART5)

#if defined(DMX_USE_UART6)
        case UART6: {
            Gd32GpioModeOutput<UART6_GPIOx, UART6_TX_GPIO_PINx>();
            GPIO_BC(UART6_GPIOx) = UART6_TX_GPIO_PINx;
            TIMER_CH2CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kBreakTimeTypical;
            s_RdmTxBuffer[dmx::config::kUart6Port].state = dmx::RdmTxState::kBreak;
            return;
        } break;
#endif // defined(DMX_USE_UART6)

#if defined(DMX_USE_UART7)
        case UART7: {
            Gd32GpioModeOutput<UART7_GPIOx, UART7_TX_GPIO_PINx>();
            GPIO_BC(UART7_GPIOx) = UART7_TX_GPIO_PINx;
            TIMER_CH3CV(TIMER4) = TIMER_CNT(TIMER4) + rdm::transmit::kBreakTimeTypical;
            s_RdmTxBuffer[dmx::config::kUart7Port].state = dmx::RdmTxState::kBreak;
            return;
        } break;
#endif // defined(DMX_USE_UART7)

        default:
            [[unlikely]] assert(false);
            break;
    }

    assert(false);
}

template <uint32_t portIndex> 
static void StartRdmOutputPort() {
    if constexpr (portIndex < dmx::config::max::kPorts) {
        StartRdmOutput<portIndex, DmxPortToUart(portIndex)>();
    }
}

void Dmx::StartRdmOutput(uint32_t port_index) {
    assert(port_index < dmx::config::max::kPorts);

    switch (port_index) {
        case 0:
            StartRdmOutputPort<0>();
            break;
#if DMX_MAX_PORTS >= 2
        case 1:
            StartRdmOutputPort<1>();
            break;
#endif
#if DMX_MAX_PORTS >= 3
        case 2:
            StartRdmOutputPort<2>();
            break;
#endif
#if DMX_MAX_PORTS >= 4
        case 3:
            StartRdmOutputPort<3>();
            break;
#endif
#if DMX_MAX_PORTS >= 5
        case 4:
            StartRdmOutputPort<4>();
            break;
#endif
#if DMX_MAX_PORTS >= 6
        case 5:
            StartRdmOutputPort<5>();
            break;
#endif
#if DMX_MAX_PORTS >= 7
        case 6:
            StartRdmOutputPort<6>();
            break;
#endif
#if DMX_MAX_PORTS >= 8
        case 7:
            StartRdmOutputPort<7>();
            break;
#endif
        default:
            [[unlikely]] break;
    }
}

// DMX Output Synchronization
void Dmx::Sync() {
    for (uint32_t port_index = 0; port_index < dmx::config::max::kPorts; port_index++) {
        auto& tx_buffer = s_DmxTxBuffer[port_index];

        if (!tx_buffer.dmx.data_pending) {
            continue;
        }

        tx_buffer.dmx.data_pending = false;

        if (sv_port_state[port_index] == dmx::PortState::kTx) {
            if ((tx_buffer.output_style == dmx::OutputStyle::kDelta) && (tx_buffer.state == dmx::TxRxState::kIdle)) {
                StartDmxOutput(port_index);
            }
        }
    }
}

// DMX Receive
const uint8_t* Dmx::GetDmxChanged([[maybe_unused]] uint32_t port_index) {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
    const auto* __restrict__ p = GetDmxAvailable(port_index);

    if (p == nullptr) {
        return nullptr;
    }

#if defined(CONFIG_DMX_DOUBLE_INPUT_BUFFER)
    auto& dmx_data_buffer = GetReadDmxDataBuffer(port_index);
    const auto* __restrict__ src32 = reinterpret_cast<const volatile uint32_t*>(dmx_data_buffer.data);
    auto* __restrict__ dst32 = reinterpret_cast<volatile uint32_t*>(sv_rx_buffer[port_index].dmx.previous.data);

    if (dmx_data_buffer.slots_in_packet != sv_rx_buffer[port_index].dmx.previous.slots_in_packet) {
        sv_rx_buffer[port_index].dmx.previous.slots_in_packet = dmx_data_buffer.slots_in_packet;

        for (size_t i = 0; i < dmx::buffer::kSize / 4; ++i) {
            dst32[i] = src32[i];
        }

        return p;
    }
#else
    const auto* __restrict__ src32 = reinterpret_cast<const volatile uint32_t*>(sv_rx_buffer[port_index].dmx.current.data);
    auto* __restrict__ dst32 = reinterpret_cast<volatile uint32_t*>(sv_rx_buffer[port_index].dmx.previous.data);

    if (sv_rx_buffer[port_index].dmx.current.slots_in_packet != sv_rx_buffer[port_index].dmx.previous.slots_in_packet) {
        sv_rx_buffer[port_index].dmx.previous.slots_in_packet = sv_rx_buffer[port_index].dmx.current.slots_in_packet;

