vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
#if DMX_MAX_PORTS >= 4
template void Dmx::SetSendDataInternal<3, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<3, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<3, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<3, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 5
template void Dmx::SetSendDataInternal<4, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<4, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<4, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<4, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 6
template void Dmx::SetSendDataInternal<5, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<5, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<5, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<5, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS >= 7
template void Dmx::SetSendDataInternal<6, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<6, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<6, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<6, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if DMX_MAX_PORTS == 8
template void Dmx::SetSendDataInternal<7, true, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<7, true, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<7, false, dmx::SendStyle::kDirect>(const uint8_t*, uint32_t);
template void Dmx::SetSendDataInternal<7, false, dmx::SendStyle::kSync>(const uint8_t*, uint32_t);
#endif

#if !defined(CONFIG_DMX_NO_OPTIMIZE)
#pragma GCC pop_options
#endif
#pragma GCC push_options
#pragma GCC optimize("Os")
// Configuration
[[gnu::noinline]]
void Dmx::SetTransmitBreakTime(uint32_t break_time) {
    s_dmx_transmit.break_time = std::max(dmx::transmit::kBreakTimeMin, break_time);
    SetTransmitPeriodTime(transmit_period_requested_);
}

[[gnu::noinline]]
uint32_t Dmx::TransmitBreakTime() const {
    return s_dmx_transmit.break_time;
}

[[gnu::noinline]]
void Dmx::SetTransmitMabTime(uint32_t mab_time) {
    s_dmx_transmit.mab_time = std::max(dmx::transmit::kMabTimeMin, mab_time);
    SetTransmitPeriodTime(transmit_period_requested_);
}

[[gnu::noinline]]
uint32_t Dmx::TransmitMabTime() const {
    return s_dmx_transmit.mab_time;
}

[[gnu::noinline]]
void Dmx::SetTransmitPeriodTime(uint32_t period) {
    transmit_period_requested_ = period;

    auto length_max = s_DmxTxBuffer[0].dmx.data[0].length;

    for (uint32_t port_index = 1; port_index < dmx::config::max::kPorts; port_index++) {
        const auto kLength = s_DmxTxBuffer[port_index].dmx.data[0].length;
        if (kLength > length_max) {
            length_max = kLength;
        }
    }

    auto package_length_micro_seconds = s_dmx_transmit.break_time + s_dmx_transmit.mab_time + (length_max * 44U);

    // The GD32F4xx/GD32H7XX Timer 1 has a 32-bit counter
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    if (package_length_micro_seconds > (static_cast<uint16_t>(~0) - 44U)) {
        s_dmx_transmit.break_time = std::min(dmx::transmit::kBreakTimeTypical, s_dmx_transmit.break_time);
        s_dmx_transmit.mab_time = dmx::transmit::kMabTimeMin;
        package_length_micro_seconds = s_dmx_transmit.break_time + s_dmx_transmit.mab_time + (length_max * 44U);
    }
#endif

    if (period != 0) {
        if (period < package_length_micro_seconds) {
            transmit_period_ = std::max(dmx::transmit::kBreakToBreakTimeMin, package_length_micro_seconds + 44U);
        } else {
            transmit_period_ = period;
        }
    } else {
        transmit_period_ = std::max(dmx::transmit::kBreakToBreakTimeMin, package_length_micro_seconds + 44U);
    }

    s_dmx_transmit.inter_time = transmit_period_ - package_length_micro_seconds;

    DEBUG_PRINTF("period=%u, nLengthMax=%u, m_nDmxTransmitPeriod=%u, nPackageLengthMicroSeconds=%u -> s_dmx_transmit.inter_time=%u", period, length_max, transmit_period_, package_length_micro_seconds, s_dmx_transmit.inter_time);
}

[[gnu::noinline]]
void Dmx::SetTransmitSlots(uint16_t slots) {
    if ((slots >= 2) && (slots <= dmx::kChannelsMax)) {
        transmit_slots_ = slots;

        for (uint32_t i = 0; i < dmx::config::max::kPorts; i++) {
            transmit_length_[i] = static_cast<uint32_t>(slots);
        }

        SetTransmitPeriodTime(transmit_period_requested_);
    }
}

[[gnu::noinline]]
void Dmx::SetOutputStyle(uint32_t port_index, dmx::OutputStyle output_style) {
    DMX_CHECK_PORT_INDEX_VOID(port_index);

    s_DmxTxBuffer[port_index].output_style = output_style;

    if (output_style == dmx::OutputStyle::kConstant) {
        if (!has_continuos_output_) {
            has_continuos_output_ = true;
            if (port_direction_[port_index] == dmx::Direction::kOutput) {
                StartDmxOutput(port_index);
            }
            return;
        }

        for (uint32_t index = 0; index < dmx::config::max::kPorts; index++) {
            if ((s_DmxTxBuffer[index].output_style == dmx::OutputStyle::kConstant) && (port_direction_[index] == dmx::Direction::kOutput)) {
                DataDisable(index);
            }
        }

        for (uint32_t index = 0; index < dmx::config::max::kPorts; index++) {
            if ((s_DmxTxBuffer[index].output_style == dmx::OutputStyle::kConstant) && (port_direction_[index] == dmx::Direction::kOutput)) {
                StartDmxOutput(index);
            }
        }
    } else {
        has_continuos_output_ = false;
        for (uint32_t index = 0; index < dmx::config::max::kPorts; index++) {
            if (s_DmxTxBuffer[index].output_style == dmx::OutputStyle::kConstant) {
                has_continuos_output_ = true;
                return;
            }
        }
    }
}

[[gnu::noinline]]
dmx::OutputStyle Dmx::GetOutputStyle(uint32_t port_index) const {
    DMX_CHECK_PORT_INDEX_RET(port_index, dmx::OutputStyle::kConstant);
    return s_DmxTxBuffer[port_index].output_style;
}

// Setup
static void UartDmxConfig(uint32_t usart_periph) {
    Gd32UartBegin(usart_periph, 250000U, gd32::kUartBits8, gd32::kUartParityNone, gd32::kUartStop2Bits);
}

static void UsartDmaConfig() {
    DMA_PARAMETER_STRUCT dma_init_struct;
    rcu_periph_clock_enable(RCU_DMA0);
    rcu_periph_clock_enable(RCU_DMA1);
#if defined(GD32H7XX)
    rcu_periph_clock_enable(RCU_DMAMUX);
#endif

#if defined(DMX_USE_USART0)
    // USART 0 TX
    dma_deinit(USART0_DMAx, USART0_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART0_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(USART0));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART0_DMAx, USART0_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART0_DMAx, USART0_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART0_DMAx, USART0_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART0_DMAx, USART0_TX_DMA_CHx, USART0_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART0_DMAx, USART0_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if !defined(GD32F4XX)
    NVIC_SetPriority(DMA0_Channel3_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel3_IRQn);
#else
    NVIC_SetPriority(DMA1_Channel7_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel7_IRQn);
#endif
#endif // DMX_USE_USART0

