vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
#if defined(DMX_USE_USART1)
    // USART 1 TX
    dma_deinit(USART1_DMAx, USART1_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART1_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(USART1));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART1_DMAx, USART1_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART1_DMAx, USART1_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART1_DMAx, USART1_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART1_DMAx, USART1_TX_DMA_CHx, USART1_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART1_DMAx, USART1_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
    NVIC_SetPriority(DMA0_Channel6_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel6_IRQn);
#endif // DMX_USE_USART1

#if defined(DMX_USE_USART2)
    // USART 2 TX
    dma_deinit(USART2_DMAx, USART2_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART2_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(USART2));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART2_DMAx, USART2_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART2_DMAx, USART2_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART2_DMAx, USART2_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART2_DMAx, USART2_TX_DMA_CHx, USART2_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART2_DMAx, USART2_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if defined(GD32F4XX) || defined(GD32H7XX)
    NVIC_SetPriority(DMA0_Channel3_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel3_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel1_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel1_IRQn);
#endif
#endif // DMX_USE_USART2

#if defined(DMX_USE_UART3)
    // UART 3 TX
    dma_deinit(UART3_DMAx, UART3_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_UART3_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(UART3));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(UART3_DMAx, UART3_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(UART3_DMAx, UART3_TX_DMA_CHx);
    dma_memory_to_memory_disable(UART3_DMAx, UART3_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(UART3_DMAx, UART3_TX_DMA_CHx, UART3_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<UART3_DMAx, UART3_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if !defined(GD32F4XX)
    NVIC_SetPriority(DMA1_Channel4_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel4_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel4_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel4_IRQn);
#endif
#endif // DMX_USE_UART3

#if defined(DMX_USE_UART4)
    // UART 4 TX
    dma_deinit(UART4_DMAx, UART4_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_UART4_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
#else
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(UART4));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F4XX) || defined(GD32H7XX)
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(UART4_DMAx, UART4_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(UART4_DMAx, UART4_TX_DMA_CHx);
    dma_memory_to_memory_disable(UART4_DMAx, UART4_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(UART4_DMAx, UART4_TX_DMA_CHx, UART4_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<UART4_DMAx, UART4_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if !defined(GD32F4XX)
    NVIC_SetPriority(DMA1_Channel3_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel3_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel7_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel7_IRQn);
#endif
#endif // DMX_USE_UART4

#if defined(DMX_USE_USART5)
    // USART 5 TX
    dma_deinit(USART5_DMAx, USART5_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_USART5_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F20X)
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(USART5));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F20X)
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(USART5_DMAx, USART5_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(USART5_DMAx, USART5_TX_DMA_CHx);
    dma_memory_to_memory_disable(USART5_DMAx, USART5_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(USART5_DMAx, USART5_TX_DMA_CHx, USART5_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<USART5_DMAx, USART5_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
    NVIC_SetPriority(DMA1_Channel6_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel6_IRQn);
#endif // DMX_USE_USART5

#if defined(DMX_USE_UART6)
    // UART 6 TX
    dma_deinit(UART6_DMAx, UART6_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_UART6_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F20X)
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(UART6));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F20X)
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(UART6_DMAx, UART6_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(UART6_DMAx, UART6_TX_DMA_CHx);
    dma_memory_to_memory_disable(UART6_DMAx, UART6_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(UART6_DMAx, UART6_TX_DMA_CHx, UART6_TX_DMA_SUBPERIx);
#endif
    Gd32DmaInterruptDisable<UART6_DMAx, UART4_TX_DMA_CHx, DMA_INTERRUPT_DISABLE>();
#if defined(GD32F20X)
    NVIC_SetPriority(DMA1_Channel4_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel4_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel1_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel1_IRQn);
#endif
#endif // DMX_USE_UART6

