vanvught/GD32F303RC-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
#if defined(DMX_USE_UART7)
    // UART 7 TX
    dma_deinit(UART7_DMAx, UART7_TX_DMA_CHx);
#if defined(GD32H7XX)
    dma_init_struct.request = DMA_REQUEST_UART7_TX;
#endif
    dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
#if defined(GD32F20X)
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
#endif
    dma_init_struct.periph_addr = reinterpret_cast<uint32_t>(&USART_TDATA(UART7));
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
#if defined(GD32F20X)
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
#else
    dma_init_struct.periph_memory_width = DMA_PERIPHERAL_WIDTH_8BIT;
#endif
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(UART7_DMAx, UART7_TX_DMA_CHx, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_disable(UART7_DMAx, UART7_TX_DMA_CHx);
    dma_memory_to_memory_disable(UART7_DMAx, UART7_TX_DMA_CHx);
#if defined(GD32F4XX)
    dma_channel_subperipheral_select(UART7_DMAx, UART7_TX_DMA_CHx, UART7_TX_DMA_SUBPERIx);
#endif
#if defined(GD32F20X)
    NVIC_SetPriority(DMA1_Channel3_IRQn, 1);
    NVIC_EnableIRQ(DMA1_Channel3_IRQn);
#else
    NVIC_SetPriority(DMA0_Channel0_IRQn, 1);
    NVIC_EnableIRQ(DMA0_Channel0_IRQn);
#endif
#endif // DMX_USE_UART7
}

static void Timer1Config() {
    rcu_periph_clock_enable(RCU_TIMER1);
    timer_deinit(TIMER1);

    timer_parameter_struct timer_initpara;
    timer_struct_para_init(&timer_initpara);

    timer_initpara.prescaler = TIMER_PSC_1MHZ;
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.period = UINT32_MAX;
    timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer_initpara.repetitioncounter = 0;
    timer_init(TIMER1, &timer_initpara);

    timer_flag_clear(TIMER1, UINT32_MAX);
    timer_interrupt_flag_clear(TIMER1, UINT32_MAX);

#if defined(DMX_USE_USART0)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
    TIMER_CH0CV(TIMER1) = UINT32_MAX;
    timer_interrupt_enable(TIMER1, TIMER_INT_CH0);
#endif // DMX_USE_USART0

#if defined(DMX_USE_USART1)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
    TIMER_CH1CV(TIMER1) = UINT32_MAX;
    timer_interrupt_enable(TIMER1, TIMER_INT_CH1);
#endif // DMX_USE_USART1

#if defined(DMX_USE_USART2)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
    TIMER_CH2CV(TIMER1) = UINT32_MAX;
    timer_interrupt_enable(TIMER1, TIMER_INT_CH2);
#endif // DMX_USE_USART2

#if defined(DMX_USE_UART3)
    timer_channel_output_mode_config(TIMER1, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);
    TIMER_CH3CV(TIMER1) = UINT32_MAX;
    timer_interrupt_enable(TIMER1, TIMER_INT_CH3);
#endif // DMX_USE_UART3

    NVIC_SetPriority(TIMER1_IRQn, 0);
    NVIC_EnableIRQ(TIMER1_IRQn);

    timer_enable(TIMER1);
}

#if defined(DMX_USE_UART4) || defined(DMX_USE_USART5) || defined(DMX_USE_UART6) || defined(DMX_USE_UART7)
static void Timer4Config() {
    rcu_periph_clock_enable(RCU_TIMER4);
    timer_deinit(TIMER4);

    timer_parameter_struct timer_initpara;
    timer_struct_para_init(&timer_initpara);

    timer_initpara.prescaler = TIMER_PSC_1MHZ;
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.period = UINT32_MAX;
    timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer_initpara.repetitioncounter = 0;
    timer_init(TIMER4, &timer_initpara);

    timer_flag_clear(TIMER4, UINT32_MAX);
    timer_interrupt_flag_clear(TIMER4, UINT32_MAX);

#if defined(DMX_USE_UART4)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
    TIMER_CH0CV(TIMER4) = UINT32_MAX;
    timer_interrupt_enable(TIMER4, TIMER_INT_CH0);
#endif // DMX_USE_UART4

#if defined(DMX_USE_USART5)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_1, TIMER_OC_MODE_ACTIVE);
    TIMER_CH1CV(TIMER4) = UINT32_MAX;
    timer_interrupt_enable(TIMER4, TIMER_INT_CH1);
#endif // DMX_USE_USART5

#if defined(DMX_USE_UART6)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_2, TIMER_OC_MODE_ACTIVE);
    TIMER_CH2CV(TIMER4) = UINT32_MAX;
    timer_interrupt_enable(TIMER4, TIMER_INT_CH2);
#endif // DMX_USE_UART6

#if defined(DMX_USE_UART7)
    timer_channel_output_mode_config(TIMER4, TIMER_CH_3, TIMER_OC_MODE_ACTIVE);
    TIMER_CH3CV(TIMER4) = UINT32_MAX;
    timer_interrupt_enable(TIMER4, TIMER_INT_CH3);
#endif // DMX_USE_UART7

    NVIC_SetPriority(TIMER4_IRQn, 0);
    NVIC_EnableIRQ(TIMER4_IRQn);

    timer_enable(TIMER4);
}
#endif

Dmx::Dmx() {
    DEBUG_ENTRY();
    assert(s_this == nullptr);
    s_this = this;

    s_dmx_transmit.break_time = dmx::transmit::kBreakTimeTypical;
    s_dmx_transmit.mab_time = dmx::transmit::kMabTimeMin;
    s_dmx_transmit.inter_time = dmx::transmit::kPeriodDefault - s_dmx_transmit.break_time - s_dmx_transmit.mab_time - (dmx::kChannelsMax * 44) - 44;

    for (uint32_t port_index = 0; port_index < DMX_MAX_PORTS; port_index++) {
        Gd32GpioFsel(kDirGpio[port_index].port, kDirGpio[port_index].pin, GPIO_FSEL_OUTPUT);
        transmit_length_[port_index] = dmx::kChannelsMax;
        sv_rx_buffer[port_index].state = dmx::TxRxState::kIdle;
        s_DmxTxBuffer[port_index].state = dmx::TxRxState::kIdle;
        SetPortDirection(port_index, dmx::Direction::kInput, false);
        SetOutputStyle(port_index, dmx::OutputStyle::kDelta);
        ClearData(port_index);
    }

    SetTransmitBreakTime(dmx::transmit::kBreakTimeTypical);
    SetTransmitMabTime(dmx::transmit::kMabTimeMin);
    SetTransmitSlots(dmx::kChannelsMax);
    SetTransmitPeriodTime(0);

    UsartDmaConfig(); // DMX Transmit
#if defined(DMX_USE_USART0) || defined(DMX_USE_USART1) || defined(DMX_USE_USART2) || defined(DMX_USE_UART3)
    Timer1Config(); // DMX Transmit -> USART0, USART1, USART2, UART3
#endif
#if defined(DMX_USE_UART4) || defined(DMX_USE_USART5) || defined(DMX_USE_UART6) || defined(DMX_USE_UART7)
    Timer4Config(); // DMX Transmit -> UART4, USART5, UART6, UART7
#endif

#if defined(DMX_USE_USART0)
    UartDmxConfig(USART0);
    NVIC_SetPriority(USART0_IRQn, 0);
    NVIC_EnableIRQ(USART0_IRQn);
#endif
#if defined(DMX_USE_USART1)
    UartDmxConfig(USART1);
    NVIC_SetPriority(USART1_IRQn, 0);
    NVIC_EnableIRQ(USART1_IRQn);
#endif
#if defined(DMX_USE_USART2)
    UartDmxConfig(USART2);
    NVIC_SetPriority(USART2_IRQn, 0);
    NVIC_EnableIRQ(USART2_IRQn);
#endif
#if defined(DMX_USE_UART3)
    UartDmxConfig(UART3);
    NVIC_SetPriority(UART3_IRQn, 0);
    NVIC_EnableIRQ(UART3_IRQn);
#endif
#if defined(DMX_USE_UART4)
    UartDmxConfig(UART4);
    NVIC_SetPriority(UART4_IRQn, 0);
    NVIC_EnableIRQ(UART4_IRQn);
#endif
#if defined(DMX_USE_USART5)
    UartDmxConfig(USART5);
    NVIC_SetPriority(USART5_IRQn, 0);
    NVIC_EnableIRQ(USART5_IRQn);
#endif
#if defined(DMX_USE_UART6)
    UartDmxConfig(UART6);
    NVIC_SetPriority(UART6_IRQn, 0);
    NVIC_EnableIRQ(UART6_IRQn);
#endif
#if defined(DMX_USE_UART7)
    UartDmxConfig(UART7);
    NVIC_SetPriority(UART7_IRQn, 0);
    NVIC_EnableIRQ(UART7_IRQn);
#endif

    DEBUG_EXIT();
}

#pragma GCC pop_options